<template>
  <NuxtLayout>
    <template #title>
      Почему так важен правильный домашний уход? 🌿
    </template>

    <section class="mb-46">
      <p class="mb-16 color-black">
        Ошибочно думать, что для поддержания хорошего внешнего вида
        необходимо лишь регулярно посещать косметолога, а в остальное
        время достаточно умывания и простого крема 💁🏼‍♀️
      </p>

      <p class="mb-16 color-black">
        Уход за лицом является целым ритуалом, важность которого
        невозможно переоценить. При наличии грамотно выстроенной системы
        ежедневный уход превращается в 10-минутное удовольствие по утрам
        и вечерам, а результат не заставит себя долго ждать 🤩
      </p>

      <p class="mb-16 color-black">
        Правильный подход к уходу за лицом всегда начинается с
        определения своего типа кожи. Это необходимо для того, чтобы
        выбрать подходящие косметические средства.
      </p>

      <p class="mb-16 color-black">
        Например, средства при жирной и сухой кожи существенно
        отличаются, и неправильный подход может привести к негативным
        последствиям.
      </p>

      <p class="mb-16 color-pink">
        Всего выделяют четыре типа кожи -
        <b>нормальная, жирная, сухая и комбинированная.</b>
      </p>

      <p class="color-black">
        Этапы по уходу за кожей лица одинаковы для всех типов,
        индивидуальны лишь косметические средства для этих процедур, для
        подбора которых изначально лучше обратиться к косметологу 👩🏼‍⚕️
      </p>
    </section>

    <a href="https://t.me/lensem">
      <Button class="mb-16">Заказать домашний уход</Button>
    </a>
    <Button outline small @click="goToBack('/')">
      Назад
    </Button>
  </NuxtLayout>
</template>

<script lang="ts" setup>
const { goToBack } = useAnimatedRouter();
</script>
