<template>
    <NuxtLayout>
        <template #title>Рекомендации после процедур</template>

        <div class="recommedation-list">
            <Accordion class="mb-24" id="superficial-peeling">
                <template #title>Поверхностный пилинг</template>

                <template #default>
                    <ol>
                        <li>
                            Воздерживаться от контактов с водой и прямых
                            солнечных лучей в течение суток.
                        </li>
                        <li>Избегать прикосновений к лицу.</li>
                        <li>
                            Сокращать время нахождения на улице и использовать
                            SPF-защиту.
                        </li>
                        <li>Пить много жидкости.</li>
                        <li>
                            Для очищения можно использовать легкие муссы и
                            пенки, а декоративную косметику можно вводить уже на
                            4 день.
                        </li>
                        <li>
                            Лучше отказаться от физических нагрузок, посещения
                            бань и саун, а также сильных очищающих средств и
                            масок.
                        </li>
                        <li>
                            В домашнем уходе не использовать средства,
                            содержащие кислоты в составе, скрабы и домашние
                            пилинги в течение 7 дней.
                        </li>
                    </ol>
                </template>
            </Accordion>

            <Accordion class="mb-24" id="medium-peeling">
                <template #title>Cрединный пилинг</template>

                <template #default>
                    <p class="h4 mb-16">
                        Восстановление может занимать от 5 до 10 дней — в этот
                        период кожа сильно краснеет и шелушится.
                    </p>

                    <ol>
                        <li>
                            Ограничить контакты с внешней средой первые 2-3 дня
                        </li>
                        <li>
                            Не удалять отслаивающуюся кожу: это может привести к
                            кровотечению, пигментации или образованию рубцов
                        </li>
                        <li>
                            Применять мягкие очищающие средства и увлажняющий
                            крем.
                        </li>
                        <li>
                            Использовать хорошую защиту от солнца (SPF-защита не
                            менее 30).
                        </li>
                        <li>
                            Лучше отказаться от физических нагрузок, посещения
                            бань и саун, а также сильных очищающих средств и
                            масок.
                        </li>
                        <li>
                            В домашнем уходе не использовать средства,
                            содержащие кислоты в составе, скрабы и домашние
                            пилинги в течение 7 дней.
                        </li>
                    </ol>
                </template>
            </Accordion>

            <Accordion class="mb-24" id="face-cleaning">
                <template #title>Чистка лица</template>

                <template #default>
                    <ol>
                        <li>
                            В день после чистки не умываться водой, эффект от
                            примененных масок еще будет продолжаться. Не
                            наносить крем и декоративную косметику.
                        </li>
                        <li>
                            После чистки 2–6 дней не посещать баню, сауну,
                            солярий, не загорать и не купаться, т.к. яркие
                            солнечные лучи могут способствовать появлению
                            пигментации, а вода в водоемах может являться
                            источником бактерий.
                        </li>
                        <li>
                            Перед выходом на улицу защищать кожу лица от солнца,
                            наносить солнцезащитный крем с высоким уровнем
                            защиты (SPF не меньше 15).
                        </li>
                        <li>
                            Не использовать тональные средства и пудру в течение
                            всего восстановительного периода, они могут
                            закупорить недавно очищенные поры.
                        </li>
                        <li>
                            Повторная чистка лица рекомендуется при нормальной
                            коже через 2–3 месяца, при жирной — через 1 месяц.
                        </li>
                        <li>
                            Не умываться горячей водой. Этот совет относится к
                            любому периоду времени, но особенно актуален после
                            чистки лица. Горячая вода стимулирует выработку
                            кожного сала‚ что может спровоцировать закупорку
                            пор.
                        </li>
                        <li>
                            Не употреблять алкоголь в течение 2-3 дней. Спирт
                            стимулирует кровообращение, повышает задержку воды в
                            тканях, что усугубит отёчность.
                        </li>
                        <li>
                            Неделю нельзя пользоваться скрабом <br />
                            и/или пилингом. Кожные покровы после чистки лица и
                            так травмированы, не нужно подвергать их еще
                            большему стрессу.
                        </li>
                        <li>
                            Без особой надобности не прикасаться к лицу. Это
                            может спровоцировать раздражение тонкого,
                            чувствительного эпидермиса, занесение инфекции в
                            ранки и трещинки.
                        </li>
                        <li>Поменять наволочку и полотенца.</li>
                    </ol>
                </template>
            </Accordion>

            <Accordion class="mb-24" id="bio">
                <template #title>Биоревитализация</template>

                <template #default>
                    <ol>
                        <li>
                            Запрещается трогать лицо, чтобы избежать
                            инфицирования.
                        </li>
                        <li>
                            Наносить декоративную косметику можно только после
                            полного заживления.
                        </li>
                        <li>Нельзя распаривать лицо 5-7 дней.</li>
                        <li>Нужно соблюдать ограничение по занятию спортом.</li>
                        <li>
                            Нельзя загорать, делать пилинг или использовать
                            скраб в течение 14 дней.
                        </li>
                        <li>
                            Не следует потреблять алкоголь. Он блокирует
                            действие препарата, из-за чего эффект от процедуры
                            будет значительно менее выраженным.
                        </li>
                    </ol>
                </template>
            </Accordion>

            <Accordion class="mb-24" id="botulinum-therapy">
                <template #title>Ботулинотерапия</template>

                <template #default>
                    <ol>
                        <li>
                            Соблюдать строгие правила гигиены в первые 24 часа —
                            не умывать лицо в течение 2-3 часов, не наносить
                            никакие кремы и декоративную косметику в течение 12
                            часов после процедуры. При возникновении ощущения
                            сухости и/или стянутости кожи можно использовать
                            только крем Бепантен Плюс.
                        </li>
                        <li>
                            Не тереть, не чесать и не разминать места инъекций,
                            равно как и всю инъецируемую область.
                        </li>
                        <li>
                            В течение 3-4 часов — сохранять вертикальное
                            положение тела.
                        </li>
                        <li>
                            В течение 24 часов — отказаться от посещения мест
                            общественного пользования: бассейнов, бань и саун,
                            тренажёрных залов, массажных кабинетов, пляжей,
                            соляриев.
                        </li>
                        <li>
                            В течение 48 часов — отказаться от физической
                            активности, особенно связанной с интенсивными и/или
                            многократными наклонами: уборка, работа на
                            приусадебных участках, длительное приготовление
                            пищи.
                        </li>
                        <li>
                            В течение 48 часов — избегать или минимизировать
                            употребление спиртных напитков.
                        </li>
                        <li>
                            В течение 14 дней — применять солнцезащитные кремы,
                            так как прямое воздействие солнечных лучей на следы
                            от инъекций может привести к появлению пигментных
                            пятен.
                        </li>
                        <li>
                            В течение 2 месяцев — избегать аппаратных методов,
                            особенно связанных с повышением температуры тканей.
                        </li>
                        <li>
                            В течение всего периода действия ботулотоксина —
                            нежелательно воздействие высоких температур и
                            интенсивных массажных методов, поскольку они могут
                            значительно сократить длительность полученного
                            эффекта. Так же не рекомендуется введение плазмы,
                            обогащенной тромбоцитами.
                        </li>
                    </ol>
                </template>
            </Accordion>

            <Accordion class="mb-24" id="lip-contouring">
                <template #title>Контурная пластика губ</template>

                <template #default>
                    <p class="mb-16">
                        <strong>Противопоказано:</strong>
                    </p>

                    <ol class="mb-32">
                        <li>Прикосновение грязными руками.</li>
                        <li>Употребление спиртного — 1 неделя.</li>
                        <li>Нанесение декоративной косметики — 5-7 дней.</li>
                        <li>Тепловые процедуры (баня, сауна) — 14 дней.</li>
                        <li>Горячая пища — 1 день</li>
                        <li>Активные тренировки — 5-7 дней.</li>
                        <li>Кроворазжижающие препараты — 2-3 дня.</li>
                        <li>
                            Перманентный татуаж и другие процедуры (до полного
                            заживления).
                        </li>
                    </ol>

                    <p class="mb-16">
                        <strong>Рекомендации:</strong>
                    </p>

                    <ol>
                        <li>
                            Протирать хлоргексидином 1-2 дня — 3 раза в день.
                        </li>
                        <li>
                            Когда спадет отек (примерно через 3 дня) необходимо
                            делать массаж 2 раза в день в течение 3 дней.
                        </li>
                        <li>
                            При гематомах — гепариновая мазь/троксевазин/лиотон
                            гель/траумель С (под пленку на 20-30 минут 1 раз
                            вечером).
                        </li>
                        <li>
                            Если есть склонность к герпес вирусной инфекции:
                            Ацикловир 200 мг х 4 раза в день в течение 7 дней,
                            или Валацикловир 500 мг х 2 раза в день в течение 7
                            дней, либо Валтрекс 500 мг х 1 раз в день в течение
                            7 дней.
                        </li>
                    </ol>
                </template>
            </Accordion>
        </div>

        <Button outline @click="goToBack('/')">Назад</Button>
    </NuxtLayout>
</template>

<script lang="ts" setup>
const { goToBack } = useAnimatedRouter();
</script>
