<template>
    <NuxtLayout>
        <template #title>Рекомендации после процедур</template>

        <div class="recommedation-list">
            <Accordion class="mb-24">
                <template #title>После легкого пилинга</template>

                <template #default>
                    <ol>
                        <li>
                            Воздерживаться от контактов с водой и прямых
                            солнечных лучей в течение суток.
                        </li>
                        <li>Избегать прикосновений к лицу.</li>
                        <li>
                            Сокращать время нахождения на улице и использовать
                            SPF защиту.
                        </li>
                        <li>Пить много жидкости.</li>
                        <li>
                            Можно использовать легкие муссы и пенки, а
                            декоративную косметику можно вводить уже на 4 день.
                        </li>
                        <li>
                            Лучше отказаться от физических нагрузок, посещения
                            бань и саун, а также сильных очищающих средств и
                            масок.
                        </li>
                    </ol>
                </template>
            </Accordion>

            <Accordion class="mb-24">
                <template #title>После срединного пилинга</template>

                <template #default>
                    <p class="h4 mb-16">
                        Восстановление может занимать от 5 до 10 дней — в этот
                        период кожа сильно краснеет и шелушится.
                    </p>

                    <ol>
                        <li>
                            Ограничить контакты с внешней средой первые 2-3 дня
                        </li>
                        <li>
                            Не удалять отслаивающуюся кожу: это может привести к
                            кровотечению, пегментации или образованию рубцов
                        </li>
                        <li>
                            Применять мягкие очищающие средства и увлажняющий
                            крем.
                        </li>
                        <li>
                            Использовать хорошую защиту от солнца (SPF-защита не
                            менее 30).
                        </li>
                        <li>
                            Лучше отказаться от физических нагрузок, посещения
                            бань и саун, а также сильных очищающих средств и
                            масок.
                        </li>
                    </ol>
                </template>
            </Accordion>

            <Accordion class="mb-24">
                <template #title>После чистки лица</template>

                <template #default>
                    <ol>
                        <li>
                            В день после чистки не умываться водой, эффект от
                            примененных масок еще будет продолжаться. Не
                            наносить крем и декоративную косметику.
                        </li>
                        <li>
                            После чистки 2–6 дней не посещать баню, сауну,
                            солярий, не загорать и не купаться, т.к. яркие
                            солнечные лучи могут способствовать появлению
                            пигментации, а вода в водоемах может являться
                            источником бактерий.
                        </li>
                        <li>
                            Перед выходом на улицу защищать кожу лица от солнца,
                            наносить солнцезащитный крем с высоким уровнем
                            защиты (SPF не меньше 15).
                        </li>
                        <li>
                            Не использовать тональные средства и пудру в течение
                            всего восстановительного периода, они могут
                            закупорить недавно очищенные поры.
                        </li>
                        <li>
                            Повторная чистка лица рекомендуется при нормальной
                            коже через 2–3 месяца, при жирной — через 1 месяц.
                        </li>
                        <li>
                            Не умываться горячей водой. Этот совет относится к
                            любому периоду времени, но особенно актуален после
                            чистки лица. Горячая вода стимулирует выработку
                            кожного сала‚ что может спровоцировать закупорку
                            пор.
                        </li>
                        <li>
                            Не употреблять алкоголь в течение 2-3 дней. Спирт
                            стимулирует кровообращение, повышает задержку воды в
                            тканях, что усугубит отёчность.
                        </li>
                        <li>
                            Неделю нельзя пользоваться скрабом и/или пилингом.
                            Кожные покровы после чистки лица и так травмированы,
                            не нужно подвергать их еще большему стрессу.
                        </li>
                        <li>
                            Без особой надобности не прикасаться к лицу. Это
                            может спровоцировать раздражение тонкого,
                            чувствительного эпидермиса, занесение инфекции в
                            ранки и трещинки.
                        </li>
                        <li>Поменять наволочку и полотенца.</li>
                    </ol>
                </template>
            </Accordion>

            <Accordion class="mb-24">
                <template #title>После биоревитализации</template>

                <template #default>
                    <ol>
                        <li>
                            Запрещается трогать лицо, чтобы избежать
                            инфицирования.
                        </li>
                        <li>
                            Наносить декоративную косметику можно только после
                            полного заживления.
                        </li>
                        <li>Нельзя распаривать лицо 5-7 дней.</li>
                        <li>Нужно соблюдать ограничение по занятию спортом.</li>
                        <li>
                            Нельзя загорать, делать пилинг или использовать
                            скраб в течение 14 дней.
                        </li>
                        <li>
                            Не следует потреблять алкоголь. Он блокирует
                            действие препарата, из-за чего эффект от процедуры
                            будет значительно менее выраженным.
                        </li>
                    </ol>
                </template>
            </Accordion>
        </div>

        <Button outline @click="goToBack('/')">Назад</Button>
    </NuxtLayout>
</template>

<script lang="ts" setup>
const { goToBack } = useAnimatedRouter();
</script>
